# GetMultiplanarDefinition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..GetMultiplanarDefinition Method
RebarShape Class See Also
---
The optional 3D structure of the shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarShapeMultiplanarDefinition GetMultiplanarDefinition()
```

Visual Basic
---
```text
Public Function GetMultiplanarDefinition As RebarShapeMultiplanarDefinition
```

Visual C++
---
```text
public:
RebarShapeMultiplanarDefinition^ GetMultiplanarDefinition()
```

# ### Return Value
A copy of the multiplanar definition. Changes will not affect the RebarShape.
# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace